-------------------------------------------------------------------------------------------------
-- Запрос 1
-- Список городов, в которых размещены пункты выдачи
-------------------------------------------------------------------------------------------------
 SELECT Count(*) AS DistinctCities
 FROM (SELECT DISTINCT City FROM pickpoint);

-------------------------------------------------------------------------------------------------
-- Запрос 2
-- Список всех товаров, упорядоченных по возрастанию количества остатков на складе
-------------------------------------------------------------------------------------------------
SELECT g.ID_clothes, g.Type, k.Remainder
FROM Goods g
JOIN Keep k ON g.ID_clothes = k.ID_clothes
ORDER BY k.Remainder ASC;

-------------------------------------------------------------------------------------------------
-- Запрос 3
-- Количество сотрудников на каждом пункте выдачи
-------------------------------------------------------------------------------------------------
 SELECT p.City, COUNT(*) AS EmployeeCount
 FROM pickpoint p
 JOIN Personnel_pick pp ON p.PointId = pp.Id_Working_Place
 GROUP BY p.City;

-------------------------------------------------------------------------------------------------
-- Запрос 4
-- Список товаров, которые есть одновременно на складе 34565 и 25678
-------------------------------------------------------------------------------------------------
 SELECT g.*
 FROM Goods g
 INNER JOIN (
 SELECT k1.ID_clothes
 FROM Keep k1
 INNER JOIN Keep k2 ON k1.ID_clothes = k2.ID_clothes
 WHERE k1.warehouse_id = 34565 AND k2.warehouse_id = 25678
 ) k ON g.ID_clothes = k.ID_clothes;

-------------------------------------------------------------------------------------------------
-- Запрос 5
-- Среднее количество товаров в корзине для каждого клиента
-------------------------------------------------------------------------------------------------
 SELECT Email, Phone_number, AVG(Quantity) AS
 Average_Items
 FROM Shopping_cart
 GROUP BY Email, Phone_number;
